src/Tasks/инкЗадачаПользователя/инкЗадачаПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>инкЗадачаПользователя</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляДоски</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправкаПисьмаОНовойЗадаче</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрикрепленныеФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.инкПриоритетЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетИНомерЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.инкПроектыКЗадачам</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.инкСтатусыЗадач</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДиалогиКЗадачеТаблица</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИДСообщения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СообщениеДиалога</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Task>

src/Enums/инкСтатусыЗадач/инкСтатусыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкСтатусыЗадач</name>
  <enumValues>
    <name>КВыполнениюПауза</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Тестирование</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
</mdclass:Enum>

src/Enums/инкПриоритетЗадачи/инкПриоритетЗадачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>инкПриоритетЗадачи</name>
  <enumValues>
    <name>Низкий</name>
  </enumValues>
  <enumValues>
    <name>Средний</name>
  </enumValues>
  <enumValues>
    <name>Высокий</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/инкЗадачаПользователяПрисоединенныеФайлы/инкЗадачаПользователяПрисоединенныеФайлы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>инкЗадачаПользователяПрисоединенныеФайлы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецФайла</name>
    <type>
      <types>TaskRef.инкЗадачаПользователя</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаема</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаМодификацииУниверсальная</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Зашифрован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндексКартинки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Редактирует</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиСинхронизацииФайлов</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИзвлеченияТекста</name>
    <type>
      <types>EnumRef.СтатусыИзвлеченияТекстаФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипХраненияФайла</name>
    <type>
      <types>EnumRef.ТипыХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>Том</name>
    <type>
      <types>CatalogRef.ТомаХраненияФайлов</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИДФайлаЭлектронногоПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьВерсии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьЭлектронныеПодписи</name>
    <attributes>
      <name>ДатаПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяФайлаПодписи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>КомуВыданСертификат</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подпись</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УстановившийПодпись</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроверкиПодписи</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодписьВерна</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьСертификатыШифрования</name>
    <attributes>
      <name>Отпечаток</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Сертификат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <comment>АПК:58</comment>
  <predefined>
    <items>
      <name>СистемнаяУчетнаяЗаписьЭлектроннойПочты</name>
      <description>Системная учетная запись</description>
    </items>
  </predefined>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьКопииСообщенийНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодХраненияСообщенийНаСервере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераВходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераИсходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверИсходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходНаСерверПередОтправкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьСкрытыеКопииПисемНаЭтотАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецУчетнойЗаписи</name>
    <comment>АПК:58</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриОтправкеПисемТребуетсяАвторизация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Tasks/инкЗадачаПользователя/ObjectModule.bsl
#Область о // Стандартные процедуры и функции:

Процедура ПередЗаписью(Отказ)
	
	ЗаполнитьЗначениямиПоУмолчанию();
	
	ОбработкаЗакрытияЗадачи();
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ЗадатьНаименованиеДляДоски();
		ОтправитьУведомлениеНаЭлПочуПоИсполнителю();
	КонецЕсли;  
	
	ОтправитьОповещениеОбИзмененииЗадачи();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ЗначениеЗаполнено(НаименованиеДляДоски) Тогда
		Записать();		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область о // Дополнительные процедуры и функции:

Процедура ОбработкаЗакрытияЗадачи()
	
	Если Статус = Перечисления.инкСтатусыЗадач.Завершено Тогда
		
		Если Ссылка.Статус <> Перечисления.инкСтатусыЗадач.Завершено Тогда
			
			КомментарийКЗадаче = Новый ФорматированныйДокумент; 
			КомментарийКЗадаче.Добавить("Задача закрыта.");
			
			ДиалогКЗадачеСтрока 			= ДиалогиКЗадачеТаблица.Добавить();
			ДиалогКЗадачеСтрока.Дата		= ТекущаяДата();	
			ДиалогКЗадачеСтрока.Автор       = Пользователи.ТекущийПользователь();
			ДиалогКЗадачеСтрока.СообщениеДиалога = Новый ХранилищеЗначения(КомментарийКЗадаче, Новый СжатиеДанных(9));
			ДиалогКЗадачеСтрока.ИДСообщения = Новый УникальныйИдентификатор;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьЗначениямиПоУмолчанию() Экспорт

	Если НЕ ЗначениеЗаполнено(Автор) Тогда
		Автор = Пользователи.ТекущийПользователь(); 
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Приоритет) Тогда
		Приоритет = Перечисления.инкПриоритетЗадачи.Низкий;
	КонецЕсли;
	
	Если Приоритет = Перечисления.инкПриоритетЗадачи.Высокий Тогда
		ПриоритетНомер = 1;
	ИначеЕсли Приоритет = Перечисления.инкПриоритетЗадачи.Средний Тогда
		ПриоритетНомер = 2;
	Иначе
		ПриоритетНомер = 3;
	КонецЕсли;   
	
	ПриоритетИНомерЗадачи = "№ "+Номер;

	ПрикрепленныеФайлы = ПроверитьПрикрепленныеФайлы();
	
	Если ПрикрепленныеФайлы Тогда
		ПриоритетИНомерЗадачи = "*" + ПриоритетИНомерЗадачи;	
	КонецЕсли;
	
КонецПроцедуры  

Функция ПроверитьПрикрепленныеФайлы()
	
	ПрикрепленныеФайлыБулево = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	инкЗадачаПользователяПрисоединенныеФайлы.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.инкЗадачаПользователяПрисоединенныеФайлы КАК инкЗадачаПользователяПрисоединенныеФайлы
		|ГДЕ
		|	инкЗадачаПользователяПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла
		|	И НЕ инкЗадачаПользователяПрисоединенныеФайлы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
    ПрикрепленныеФайлыБулево = (РезультатЗапроса.Количество() > 0);
	
	Возврат ПрикрепленныеФайлыБулево;
	
КонецФункции

Процедура ЗадатьНаименованиеДляДоски()
	
	ПриоритетСтрока = "";
	Если ЗначениеЗаполнено(Приоритет) Тогда
		ПриоритетСтрока = " Приоритет: "+Приоритет+".";	
	КонецЕсли;
	
	НаименованиеДляДоски = Наименование 
	                     + ПриоритетСтрока
	                     + " " + Номер;		
	
КонецПроцедуры

&НаСервере
Функция ПолучитьХТМЛКодКартинки(СсылкаСтрока) Экспорт
	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СсылкаСтрока, ";");	
	НомерСтроки = "";
	ИДКартинки = "";
	Для каждого ЭлементСтрока Из МассивСтрок Цикл
		
		Если СтрНайти(ЭлементСтрока,"НомерСтроки=") > 0 Тогда
			НомерСтроки = Сред(ЭлементСтрока,13,СтрДлина(ЭлементСтрока));
			Продолжить;
		ИначеЕсли СтрНайти(ЭлементСтрока,"Картинка=") > 0 Тогда	
			ИДКартинки = Сред(ЭлементСтрока,10,СтрДлина(ЭлементСтрока));
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;

	Если НомерСтроки = "" ИЛИ ИДКартинки = "" Тогда
		Возврат "";
	КонецЕсли;  
	
	ФорматированныйТекст = ЭтотОбъект.ДиалогиКЗадачеТаблица[НомерСтроки-1].СообщениеДиалога.Получить();
	
	ТекстHTML = "";  
	Вложения = Новый Структура;
	
	ФорматированныйТекст.ПолучитьHTML(ТекстHTML, Вложения);
	
	ХТМЛКодКартинки = "<!DOCTYPE html>
                       |<html dir=""ltr"">
                       |<head>
                       |<meta http-equiv=""Content-Type"" content=""text/html; charset=utf-8"" />
                       |<meta http-equiv=""X-UA-Compatible"" content=""IE=Edge"" />
                       |<meta name=""format-detection"" content=""telephone=no"" />
                       |<style type=""text/css"">
                       |body{margin:0;padding:8px;}
                       |p{line-height:1.15;margin:0;white-space:pre-wrap;}
                       |ol,ul{margin-top:0;margin-bottom:0;}
                       |img{border:none;}
                       |li>p{display:inline;}
                       |</style>
                       |</head>
                       |<body>
                       |<br>
                       |<p><img src=""imageXXX"" style=""border:none;""/></p>
                       |<br>
                       |</body>
                       |</html>
                       |'";
	
	
	ХТМЛКодКартинки	= СтрЗаменить(ХТМЛКодКартинки, 
	            " src=""imageXXX""", 
				" src=""data:image/png;base64, " 
				+ Base64Строка(Вложения[ИДКартинки].ПолучитьДвоичныеДанные()) + """" 
				);                
				
	Возврат ХТМЛКодКартинки;			
	
КонецФункции

#КонецОбласти

#Область о // Отправка уведомления на эл. почту:

Процедура ОтправитьОповещениеОбИзмененииЗадачи()

	Если НЕ Константы.инкОтправкаСообщенийПриИзмененииЗадачи.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		Возврат;
	КонецЕсли;
	
	Если ДиалогиКЗадачеТаблица.Количество() <= Ссылка.ДиалогиКЗадачеТаблица.Количество() Тогда
		Возврат;	
	КонецЕсли;	
	
	ПоследнееСообщениеЗадачи = ДиалогиКЗадачеТаблица[ДиалогиКЗадачеТаблица.Количество()-1];
	АвторСообщения = ПоследнееСообщениеЗадачи.Автор;
	
	ПолучателиПисьма = Новый Массив;
	Если АвторСообщения = Исполнитель Тогда
		
		Если АвторСообщения = Автор Тогда
			Возврат;
		Иначе
			ПолучателиПисьма.Добавить(Автор);	
		КонецЕсли;		
		
	ИначеЕсли АвторСообщения = Автор Тогда
		
		Если АвторСообщения = Исполнитель Тогда
			Возврат;
		Иначе
			ПолучателиПисьма.Добавить(Исполнитель);	
		КонецЕсли;		

	Иначе 
		Если Автор = Исполнитель Тогда
			ПолучателиПисьма.Добавить(Автор);
		Иначе
			ПолучателиПисьма.Добавить(Автор);
			ПолучателиПисьма.Добавить(Исполнитель);
		КонецЕсли;
	КонецЕсли;
	
	СодержаниеСообщения = ПоследнееСообщениеЗадачи.СообщениеДиалога.Получить().ПолучитьТекст();
	
	// Тема письма:
	ТемаПисьмаСтрока = "Проект: "+Проект+". Изменена задача: " + НаименованиеДляДоски + ".";
	// Тело письма:
	ТелоПисьмаСтрока = "Добрый день. Изменена задача: " + НаименованиеДляДоски 
					 + "."
					 + Символы.ПС
					 + Символы.ПС
					 + "Проект: "+Проект
					 + Символы.ПС
					 + "Автор: "+Автор
					 + Символы.ПС
					 + "Исполнитель: "+Исполнитель					 
					 + Символы.ПС
					 + Символы.ПС
					 + "Содержание сообщения: "
					 + СодержаниеСообщения
					 ;

	ОтправитьЭлектронноеПисьмо(ПолучателиПисьма, ТелоПисьмаСтрока, ТемаПисьмаСтрока);					 
	
КонецПроцедуры

Процедура ОтправитьУведомлениеНаЭлПочуПоИсполнителю()
	
	Если НЕ Константы.инкВключитьРассылкуОНовыхЗадачах.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтправкаПисьмаОНовойЗадаче Тогда
		Возврат;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		Возврат;
	КонецЕсли;	
	
	Если Исполнитель = Автор Тогда
		Возврат;	
	КонецЕсли;
	
	// Тема письма:
	ТемаПисьмаСтрока = "Проект: "+Проект+". Добавлена задача: " + НаименованиеДляДоски;
	// Тело письма:
	ТелоПисьмаСтрока = "Добрый день. Добавлена задача: " + НаименованиеДляДоски 
					 + "."
					 + Символы.ПС
					 + Символы.ПС
					 + "Проект: "+Проект
					 + Символы.ПС
					 + "Автор: "+Автор
					 + Символы.ПС
					 + "Исполнитель: "+Исполнитель					 
					 ;
					 
	ПолучателиПисьма = Новый Массив;				 
	ПолучателиПисьма.Добавить(Исполнитель);    
	
	ОтправитьЭлектронноеПисьмо(ПолучателиПисьма, ТелоПисьмаСтрока, ТемаПисьмаСтрока);					 
					 
КонецПроцедуры

Процедура ОтправитьЭлектронноеПисьмо(ПолучателиПисьма, ТелоПисьмаСтрока, ТемаПисьмаСтрока)
	
	АдресЭлектроннойПочты = "";
	Для каждого ПолучательПисьма Из ПолучателиПисьма Цикл
		АдресЭлектроннойПочты = АдресЭлектроннойПочты
		                      + БизнесПроцессыИЗадачиСервер.АдресЭлектроннойПочты(ПолучательПисьма)
							  + "; ";	
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(АдресЭлектроннойПочты) Тогда
		Возврат;
	КонецЕсли;
	
	ТипОповещенияСтрока = "Отправка оповещения по задаче";
	
	Попытка
		ПриведенныйПочтовыйАдрес = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(АдресЭлектроннойПочты);
	Исключение
		ЗаписьЖурналаРегистрации(ТипОповещенияСтрока, 
                                 УровеньЖурналаРегистрации.Ошибка, 
                                 , 
                                 ТекущаяДата(), 
                                 КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	ПараметрыПисьма = Новый Структура;
	Если ЗначениеЗаполнено(ПриведенныйПочтовыйАдрес) Тогда
		ПараметрыПисьма.Вставить("Кому", ПриведенныйПочтовыйАдрес);
	КонецЕсли;

	ПараметрыПисьма.Вставить("Тема", ТемаПисьмаСтрока);
	ПараметрыПисьма.Вставить("Тело", ТелоПисьмаСтрока);
	
	СистемнаяУчетнаяЗаписьЭлектроннойПочты = Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты;
	
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыПисьма);
		
		ТекстОповещения = "Успешно отправлено письмо: "
						+ " получателям: "
						+ ПриведенныйПочтовыйАдрес
						+ " тело письма: "
						+ ТелоПисьмаСтрока;
		
		ЗаписьЖурналаРегистрации(ТипОповещенияСтрока, 
                                 УровеньЖурналаРегистрации.Информация, 
                                 , 
                                 ТекущаяДата(), 
                                 ТекстОповещения);
								 
		ОтправкаПисьмаОНовойЗадаче = Истина;						 
		
	Исключение                 
		
		ИнформацияОбОшибкеСтрока = ИнформацияОбОшибке();
		
		ЗаписьЖурналаРегистрации(ТипОповещенияСтрока, 
                                 УровеньЖурналаРегистрации.Ошибка, 
                                 , 
                                 ТекущаяДата(), 
                                 ИнформацияОбОшибкеСтрока);
	КонецПопытки; 
	
	
КонецПроцедуры

#КонецОбласти
